zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
static osStatus jd_master_com_send_play_msg(jd_om_comm *hdl,unsigned char type, void *req_data)
{
	pic_play_msg *msg = NULL;

	switch (type){

		case REQ_TRANS_FILE_HEAD:
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_file_update_start;

			msg->msg.info_file.type = ((REQ_TRANS_FILE_HEAD_T *)req_data)->type;

			memset(msg->msg.info_file.file_name,0,sizeof(msg->msg.info_file.file_name));
			memcpy(msg->msg.info_file.file_name,((REQ_TRANS_FILE_HEAD_T *)req_data)->file_name,64);
			memcpy(msg->msg.info_file.md5,((REQ_TRANS_FILE_HEAD_T *)req_data)->md5,MD5_SIZE);
			break;

		case REQ_TRANS_FILE_END:	//file transfering completed!
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_file_update_end;
			msg->msg.info_file.type = recv_file_des.type;
			memset(msg->msg.info_file.file_name,0,sizeof(msg->msg.info_file.file_name));
			snprintf(msg->msg.info_file.file_name,64,"%s",strrchr(recv_file_des.file_path,'/')+1);
			break;

		default:
			dzlog_error("%s:unknown type=%d.\r\n",__func__,type);
			break;
	}

	if(msg){
		jd_om_mq_send(&(hdl->uart_comm_des.play_queue), msg);
		//wait play task to set responsed
		jd_om_sem_wait(&(hdl->uart_comm_des.sem),0);
		return osOK;
	}
	return osErrorOS;
}
#endif

static osStatus jd_master_com_send_response(jd_om_comm *hdl,unsigned char type, void *data)
{
	int payload_size;
	unsigned char res_type;
	//unsigned int material_num = 0;
	osStatus ret;

	switch (type) {

	case REQ_DEVICE_INFO:
	{
		res_type = RES_DEVICE_INFO;
		payload_size = sizeof(RES_DEVICE_INFO_T);
		break;
	}
	case REQ_SET_SN:
	{
		res_type = RES_SET_SN;
		payload_size = sizeof(RES_SET_SN_T);
		break;
	}

	case REQ_GET_TIME:
	{
		res_type = RES_GET_TIME;
		payload_size = sizeof(RES_GET_TIME_T);
		break;
	}

	case REQ_SET_TIME:
	{
		res_type = RES_SET_TIME;
		payload_size = sizeof(RES_SET_TIME_T);
		break;
	}
	case REQ_FLASH_LED:
	{
		res_type = RES_FLASH_LED;
		payload_size = sizeof(RES_SET_FLASH_LED_T);
		break;
	}
	case REQ_SLOT_LED:
	{
		res_type = RES_SLOT_LED;
		payload_size = sizeof(RES_SET_SLOT_LED_T);
		break;
	}
	case REQ_SLOT_ELOCK:
	{
		res_type = RES_SLOT_ELOCK;
		payload_size = sizeof(RES_SET_SLOT_ELOCK_T);
		break;
	}
	case REQ_SLOT_POWER:
	{
		res_type = RES_SLOT_POWER;
		payload_size = sizeof(RES_SET_SLOT_POWER_T);
		break;
	}
	case REQ_SLOT_KEY_STAT:
	{
		res_type = RES_SLOT_KEY_STAT;
		payload_size = sizeof(RES_GET_SLOT_KEY_T);
		break;
	}
	case REQ_BATTERY_ENCRYPT:
	{
		res_type = RES_BATTERY_ENCRYPT;
		payload_size = sizeof(RES_BATTERY_ENCRYPT_T);
		break;
	}
	case REQ_BATTERY_INFO:
	{
		res_type = RES_BATTERY_INFO;
		payload_size = sizeof(RES_BATTERY_INFO_T);
		break;
	}
	case REQ_GPRS_MODULE_INFO:
	{
		res_type = RES_GPRS_MODULE_INFO;
		payload_size = sizeof(RES_GPRS_MODULE_INFO_T);
		break;
	}
	case REQ_GPRS_CONNECT:
	{
		res_type = RES_GPRS_CONNECT;
		payload_size = sizeof(RES_GPRS_CONNECT_T);
		break;
	}
	case REQ_DEVICE_AGEING:
	{
		res_type = RES_DEVICE_AGEING;
		payload_size = sizeof(RES_AGEING_T);
		break;
	}
	case REQ_ENV_TEMPRATURE:
	{
		res_type = RES_ENV_TEMPRATURE;
		payload_size = sizeof(RES_TEMPRATURE_T);
		break;
	}

	default:
		return osErrorOS;
	}

	int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
	MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

	pkt->head.start = START_CMD;
	pkt->head.slave = SLAVE_1;
	pkt->head.type = res_type;
	pkt->head.payload_len = payload_size;

	memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), (char *)data, payload_size);

	unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
	memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(uart_comm_des.send_queue), (void *)pkt);
	if (osErrorOS == ret)
		dzlog_error("res[%02x] to queue error\r\n", res_type);

	return ret;
}
#if 0
static osStatus jd_master_com_send_exception_response(jd_om_comm *hdl,unsigned char type, void *data)
{
	int payload_size;
	unsigned char res_type;
	osStatus ret;

	res_type = (type&0x0F)|0xA0;
	payload_size = sizeof(RES_COMMON_T);

	int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
	MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

	pkt->head.start = START_CMD;
	pkt->head.slave = SLAVE_1;
	pkt->head.type = res_type;
	pkt->head.payload_len = payload_size;

	memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), (char *)data, payload_size);

	unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
	memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(uart_comm_des.send_queue), (void *)pkt);
	if (osErrorOS == ret)
		dzlog_error("res[%02x] to queue error\r\n", res_type);

	return ret;
}
#endif
int uart_sent_dumb()
{
	int ret = -1;
	int payload_len = 512;
	int pkt_len = sizeof(MSG_UART_HEAD_T) + payload_len + CHECKSUM_SIZE;
	static u32 packetid = 0;
	unsigned char *pt = jd_om_malloc(pkt_len);

	MSG_UART_HEAD_T *head = (MSG_UART_HEAD_T *)pt;

	head->start = START_CMD;
	head->type = RES_GET_TIME;
	head->payload_len = payload_len;
	head->packet_id = packetid++;

	memset(pt + sizeof(MSG_UART_HEAD_T), 0xde, payload_len);

	unsigned short checksum = crc16((char *)pt, pkt_len - CHECKSUM_SIZE);
	memcpy((char *)pt + pkt_len - CHECKSUM_SIZE, &checksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(uart_comm_des.send_queue), (void *)pt);
	if (ret) {
		dzlog_error("%s send msg error\n", __func__);
		jd_om_free(pt);
	}

	return 0;
}

u8 get_packet_id()
{
	static unsigned char uart_packet_id = 0;
	return uart_packet_id++;
}


int wait_battery_response(EventBits_t bat_evt, TickType_t timeout)
{
	EventBits_t bits;
	xEventGroupClearBits(BatteryResEvents, bat_evt);
	bits = xEventGroupWaitBits(BatteryResEvents, bat_evt, (BaseType_t)pdTRUE, (BaseType_t)pdTRUE, timeout);
	if (bits & bat_evt) {
		return 0;
	} else {
		dzlog_debug("######## wait event %d err %d\n", bat_evt, bits);
		return -1;
	}
}


#define SECONDS_IN_A_DAY (86400U)
#define SECONDS_IN_A_HOUR (3600U)
#define SECONDS_IN_A_MINUTE (60U)
#define DAYS_IN_A_YEAR (365U)
#define YEAR_RANGE_START (1970U)
#define YEAR_RANGE_END (2099U)
#if 0
static void RTC_ConvertSecondsToDatetime(uint32_t seconds, rtc_datetime_t *datetime)
{
    assert(datetime);

    uint32_t x;
    uint32_t secondsRemaining, days;
    uint16_t daysInYear;
    /* Table of days in a month for a non leap year. First entry in the table is not used,
     * valid months start from 1
     */
    uint8_t daysPerMonth[] = {0U, 31U, 28U, 31U, 30U, 31U, 30U, 31U, 31U, 30U, 31U, 30U, 31U};

    /* Start with the seconds value that is passed in to be converted to date time format */
    secondsRemaining = seconds;

    /* Calcuate the number of days, we add 1 for the current day which is represented in the
     * hours and seconds field
     */
    days = secondsRemaining / SECONDS_IN_A_DAY + 1;

