zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
	return snSet;
}

static unsigned char jd_master_com_set_dev_id(char *device_id)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	unsigned char tmp_dev_id[DEVICE_ID_LEN+1];
	int i=0;
	unsigned char ret = 0;	//default 0:ok.

	memset(tmp_dev_id,0,sizeof(tmp_dev_id));
	memcpy(tmp_dev_id,device_id,DEVICE_ID_LEN);
	for(i=0;i<DEVICE_ID_LEN;i++){
		dzlog_debug("%s:Write EEPROM...%d Value = %c\r\n",__func__,i,(char)tmp_dev_id[i]);
	}

	//write the device id into eeprom
	for(i=0;i<(DEVICE_ID_LEN/4);i++){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_DEVID+(i*4),
			(tmp_dev_id[i*4]<<24)|(tmp_dev_id[i*4+1]<<16)|(tmp_dev_id[i*4+2]<<8)|tmp_dev_id[i*4+3]);
	}

	//read out the device id from eeprom
	for(i=0;i<(DEVICE_ID_LEN/4);i++){
		eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_DEVID +(i*4)));
		if(eeprom_data != ((tmp_dev_id[i*4]<<24)|(tmp_dev_id[i*4+1]<<16)|(tmp_dev_id[i*4+2]<<8)|tmp_dev_id[i*4+3])){
			dzlog_error("%s:Read EEPROM error...%d eeprom_Value = 0x%X,origin_Value = %02x %02x %02x %02x\r\n",
				__func__,i,eeprom_data,tmp_dev_id[i*4],tmp_dev_id[i*4+1],tmp_dev_id[i*4+2],tmp_dev_id[i*4+3]);
			ret = 1;
			break;
		}
	}
	//set the valid flag if write device id ok.
	if(ret==0){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_DEVID_FLAG,EEPROM_DEVID_FLAG_VALID);
		dzlog_debug("%s:Write DeviceId to EEPROM sucessful\r\n",__func__);
	}
	return ret;
}

static bool jd_master_com_get_dev_id(unsigned char *device_id)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;
	unsigned char tmp_dev_id[DEVICE_ID_LEN+1];
	bool devIdSet = false;

	eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_DEVID_FLAG));
	if(eeprom_data == EEPROM_DEVID_FLAG_VALID){
		for(i=0;i<(DEVICE_ID_LEN/4);i++){
			eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_DEVID +(i*4)));
			tmp_dev_id[i*4] = (eeprom_data>>24)&0xFF;
			tmp_dev_id[i*4+1] = (eeprom_data>>16)&0xFF;
			tmp_dev_id[i*4+2] = (eeprom_data>>8)&0xFF;
			tmp_dev_id[i*4+3] = eeprom_data&0xFF;
		}
		memcpy(device_id,tmp_dev_id,DEVICE_ID_LEN);
		devIdSet = true;
	}

	return devIdSet;
}

static void jd_master_com_get_hw_ver(jd_om_comm *hdl,unsigned char *hw_ver)
{
	hw_ver[0] = hdl->hw_ver[0];
	hw_ver[1] = hdl->hw_ver[1];
	hw_ver[2] = hdl->hw_ver[2];
	hw_ver[3] = hdl->hw_ver[3];
}

static void jd_master_com_get_fw_ver(unsigned char *fw_ver)
{
	fetch_fw_ver(fw_ver);
}

static void jd_master_get_volume_level(unsigned char vol/*input:0~31*/,voice_volume_level *out_lvl)
{
	int i;

	for(i=0;i<sizeof(volume_table)/sizeof(volume_relation);i++){
		if(vol == volume_table[i].val){
			*out_lvl = volume_table[i].level;
			break;
		}
	}
}

static void jd_master_com_fill_device_info(jd_om_comm *hdl,RES_DEVICE_INFO_T **res)
{
	int material_num = 0,i = 0;
	RES_DEVICE_INFO_T *response = NULL;
	unsigned char dev_ready = 0;
	bool mute_on = false;
	unsigned char volume = 0;
	voice_volume_level volume_level = volume_mute;

#ifdef PLAY_SCHEDULE_LIST
	AdvMaterialInfo *adv_material = NULL;
	MaterialList *_Materal = NULL;
	if(jd_om_mutex_try_lock(&(hdl->uart_comm_des.schedule_mutex))){
		//no ready
		dzlog_error("%s:schedule no_ready wait@1?\r\n",__func__);
	}
	else{
		if(hdl->uart_comm_des.current_schedule == NULL){
			//no ready
			jd_om_mutex_unlock(&(hdl->uart_comm_des.schedule_mutex));
			dzlog_error("%s:schedule no_ready wait@2?\r\n",__func__);
		}

		else if(hdl->uart_comm_des.current_schedule->InCritical){
			//no ready
			jd_om_mutex_unlock(&(hdl->uart_comm_des.schedule_mutex));
			dzlog_error("%s:schedule in critical wait@3?\r\n",__func__);
		}
		else
			dev_ready = 1;
	}

	if(dev_ready){
		material_num = hdl->uart_comm_des.current_schedule->total_num;
		*res = jd_om_malloc(sizeof(RES_DEVICE_INFO_T) + material_num*sizeof(AdvMaterialInfo));
		//fill device status
		response = *res;
		response->ready_flag = 1;
		response->Encrypted = is_null_data(hdl->cipher,sizeof(hdl->cipher))?0:1;
		pic_play_get_mp3_volume_info(&mute_on,&volume);
		jd_master_get_volume_level(volume,&volume_level);
		response->volume = mute_on?0:volume_level;	//0:mute,1:low,2:middle,3:high.
		memset(response->sn,0,sizeof(response->sn));
		jd_master_com_get_dev_sn((unsigned char *)(response->sn));
		jd_master_com_get_dev_id((unsigned char *)(response->device_id));
		jd_master_com_get_hw_ver(hdl,response->hw_ver);
		jd_master_com_get_fw_ver(response->fw_ver);
		//fill schedule info
		response->schedule.schedule_id = hdl->uart_comm_des.current_schedule->scheduleId;
		memcpy(response->schedule.schedule_md5,hdl->uart_comm_des.current_schedule->file_md5,16);
		response->schedule.material_num = material_num;
		//file material array
		if(material_num > 0){
			adv_material = (AdvMaterialInfo *)((unsigned char *)response + sizeof(RES_DEVICE_INFO_T));
			_Materal = hdl->uart_comm_des.current_schedule->first_material;
			for(i=0;i<material_num;i++){
				adv_material[i].service_code = _Materal->material.service_code;
				//picture info.
				adv_material[i].pic_material_id = _Materal->material.materialId;
				adv_material[i].pic_play_count = _Materal->material.playCount;
				memcpy(adv_material[i].pic_md5,_Materal->material.file_md5,16);
				//voice info.
				adv_material[i].voice_material_id = _Materal->material.voice_materialId;
				adv_material[i].voice_play_count = FILE_MD5_IS_NULL(_Materal->material.voice_file_md5)?0:(_Materal->material.playCount);
				memcpy(adv_material[i].voice_md5,_Materal->material.voice_file_md5,16);
				_Materal = _Materal->next;
			}
		}
		jd_om_mutex_unlock(&(hdl->uart_comm_des.schedule_mutex));
	}
	else{
		*res = jd_om_malloc(sizeof(RES_DEVICE_INFO_T));
		response = *res;
		response->ready_flag = 0;
	}
#endif
}
#endif
static char recv_data_dispatch(jd_om_comm *hdl,char *pt,bool *file_trans,UINT *trans_timeout_cnt)
{
	char payload[MAX_QUEUE_ELEMENT_SIZE] = { 0 };
	MSG_UART_HEAD_T* head = (MSG_UART_HEAD_T*)pt;
	static unsigned char last_session_id = -1;
	//static unsigned int old_pkt_id = 1;
	unsigned int payload_len = 0;
	unsigned char type;

	// 获取start字段
	unsigned char start = head->start;

	//	判断start字段值是否正确
	if (START_CMD != start) {
		dzlog_error("recv invalid packet\r\n");
		goto FREE;
	}

