zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
	// 获取type字段
	type = head->type;
	//dzlog_debug("recv type %02x\r\n", type);

	//判断start字段值是否正确
	switch(get_cmd_typte(type)) {
		case TYPE_INVALID:
			goto FREE;
		case TYPE_RES:
			set_active_res(type);
			break;
		case TYPE_REQ:
			break;
		default:
			break;
	}

	if(head->packet_id == last_session_id){
		dzlog_error("recv repeat packet\r\n");
		goto FREE;
	}
	else{
		last_session_id = head->packet_id;
	}

	// 获取payload_len字段
	payload_len = head->payload_len;

	// 校验payload_len合法
	if (payload_len >= MAX_QUEUE_ELEMENT_SIZE) {
		dzlog_error("recv invalid payload_len:%d\r\n",payload_len);
		goto FREE;
	}

	// 获取payload
	memset(payload, 0, MAX_QUEUE_ELEMENT_SIZE);
	memcpy(payload, pt + sizeof(MSG_UART_HEAD_T), payload_len);


	//获取checksum
	unsigned short chksum;
	memcpy(&chksum, pt + sizeof(MSG_UART_HEAD_T) + payload_len, sizeof(chksum));
	if (chksum != crc16(pt, sizeof(MSG_UART_HEAD_T) + payload_len)) {
		dzlog_error("checksum wrong\r\n");
		goto FREE;
	}

	switch (type) {

	case REQ_DEVICE_INFO:
		{
			dzlog_debug("get device info\r\n");
			RES_DEVICE_INFO_T res;
			res.code = 0;
			snprintf((char *)res.sn, 16, "%s", "AB12345678");
			get_md5((unsigned char *)res.sn_md5, (char const *)res.sn, 1);
			memcpy((char *)res.cpuid, "AAAABBBBCCCC", 12);
			get_md5((unsigned char *)res.cpuid_md5, (char const *)res.cpuid, 1);
			snprintf((char *)res.fw_ver, 4, "%c%c%c%c", 1,0,0,0);
			snprintf((char *)res.hw_ver, 4, "%c%c%c%c", 1,0,1,0);
			res.Encrypted = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_SET_SN:
		{
			REQ_SET_SN_T *req = (REQ_SET_SN_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set sn : %s\r\n", req->sn);


			RES_SET_SN_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
		case REQ_GET_TIME:
		{
			dzlog_debug("get rtc time 1555733950\r\n");
			RES_GET_TIME_T res;
			res.time_sec = 1555733950;//jd_master_com_get_system_time_second();
			res.time_usec = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_SET_TIME:
		{
			REQ_SET_TIME_T * req = (REQ_SET_TIME_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set time sec %d \r\n", req->time_sec);

			RES_SET_TIME_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_FLASH_LED:
		{
			REQ_SET_FLASH_LED_T *req = (REQ_SET_FLASH_LED_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set flash led %d\r\n", req->led_status);


			RES_SET_FLASH_LED_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_SLOT_LED:
		{
			REQ_SET_SLOT_LED_T *req = (REQ_SET_SLOT_LED_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set slot %d led to %d\r\n", req->slot_num, req->led_status);


			RES_SET_SLOT_LED_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_SLOT_ELOCK:
		{
			REQ_SET_SLOT_ELOCK_T *req = (REQ_SET_SLOT_ELOCK_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set slot %d lock to %d\r\n", req->slot_num, req->elock_status);


			RES_SET_SLOT_ELOCK_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_SLOT_POWER:
		{
			REQ_SET_SLOT_POWER_T *req = (REQ_SET_SLOT_POWER_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set slot %d power to %d\r\n", req->slot_num, req->power_status);

			RES_SET_SLOT_POWER_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_SLOT_KEY_STAT:
		{
			REQ_GET_SLOT_KEY_T *req = (REQ_GET_SLOT_KEY_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("get slot %d key status\r\n", req->slot_num);

			RES_GET_SLOT_KEY_T res;
			res.code = 0;
			res.key_status = 1;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_BATTERY_ENCRYPT:
		{
			REQ_BATTERY_ENCRYPT_T *req = (REQ_BATTERY_ENCRYPT_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set battery %d opt %d\r\n", req->slot_num, req->opt);

			RES_BATTERY_ENCRYPT_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_BATTERY_INFO:
		{
			REQ_BATTERY_INFO_T *req = (REQ_BATTERY_INFO_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("get battery %d info opt %d\r\n", req->slot_num, req->opt);

			RES_BATTERY_INFO_T res;
			res.code = 0;
			snprintf((char *)res.sn, 16, "%s", "BAT1234567");
			res.temperature = 23;
			res.voltage = 4100;	//电压
			res.ratio = 88;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_GPRS_MODULE_INFO:
		{
			dzlog_debug("get gprs info\r\n");

			RES_GPRS_MODULE_INFO_T res;
			res.code = 0;	//响应代码：ok �?，fail�?
			snprintf(res.module_name,16, "%s", "MITU"); //模块�?
			memcpy(res.Iccid, "12345678901234567890", 20); //iccid
			res.module_ready = 1;//模块是否正常
			res.simcard_ready = 1;//sim卡是否正�?
			res.gprs_ready = 1;	//gprs 是否正常
			res.rssi = 20;		//rssi
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_GPRS_CONNECT:
		{
			REQ_GPRS_CONNECT_T * req = (REQ_GPRS_CONNECT_T*)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("gprs connect opt %d\r\n", req->opt);

			RES_GPRS_CONNECT_T res;
			res.code = 0;	//响应代码：ok �?，fail�?
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_DEVICE_AGEING:
		{
			REQ_AGEING_T *req = (REQ_AGEING_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("ageing opt %d\r\n", req->opt);
			RES_AGEING_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}
	case REQ_ENV_TEMPRATURE:
		{
			dzlog_debug("get temprature\r\n");
			RES_TEMPRATURE_T res;
			res.code = 0;
			res.temperature = 23;
			jd_master_com_send_response(hdl,type,(void *)&res);
			break;
		}

		case RES_BAT_SET_SN_PSW:
		{
			RES_BAT_SET_SN_PSW_T *res = (RES_BAT_SET_SN_PSW_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++set battery sn res %d\r\n", res->code);
			memcpy(&br_set_sn, res, sizeof(RES_BAT_SET_SN_PSW_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_SET_SN);
			break;
		}
		case RES_BAT_GET_INFO:
		{
			RES_BAT_GET_INFO_T *res = (RES_BAT_GET_INFO_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++get battery info sn len %d sn %s temp %d vol_h %d vol_l %d ratio %d\r\n",
				res->sn_len,		//sn 有效长度
				res->sn,		//sn
				res->Temp,			//温度: 16进制温度值（单位：摄氏度）+偏移量 40(避免负温度)
				res->Vol_H,		//电压：高位
				res->Vol_L,		//电压：低位
				res->ratio);		//16进制
			memcpy(&br_get_info, res, sizeof(RES_BAT_GET_INFO_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_GET_INFO);
			break;
		}
		case RES_BAT_ENCODE:
		{
			RES_BAT_ENCODE_T *res = (RES_BAT_ENCODE_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery encode res %d\r\n", res->code);
			memcpy(&br_encode, res, sizeof(RES_BAT_ENCODE_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_ENCODE);
			break;
		}
		case RES_BAT_DECODE:
		{
			RES_BAT_DECODE_T *res = (RES_BAT_DECODE_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery decode res %d \r\n", res->code);
			memcpy(&br_decode, res, sizeof(RES_BAT_DECODE_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_DECODE);
			break;
		}
		case RES_BAT_VIRTUAL_PWR_INFO:
		{

